window.BAZI_SUMMARYS = {
	"甲日甲子": `六甲日生甲子时，败中印绶官生至；月通木气不寻常，反此而言虚名利。
甲日甲子时，虽甲败在子(沐浴)，暗有癸水生气印绶，兼有官生其印，若己土破印，通月气，贵。否则，秀而不实。
# 2-86有天月德贵人、通根于月、有权。
# 1-155正印旺，女不靠子女

甲子日甲子时，子遥巳格，年月无庚辛申酉，丑绊午冲，离祖自立，贵。
若年月俱寅，逢申酉运，大富后退财。子亥卯未年月，行西运，贵。甲辰月亦贵。
酉月，只以正官格论，大贵。巳午戌月，平常。午月，甲死子冲，尤不吉。乙卯、乙巳月，主法死。`,
	"甲日乙丑": `六甲日生时乙丑,劫财羊刃不宜有; 柱中逢火带辛金,制伏和平贵亦久。
甲日乙丑时,辛金为官,己土为财,丑中暗己,被明乙劫夺,乙丑金神,若年日时合成火局,得制伏,主德性纯和而贵;无火凶狠;如合水局凶恶损家。
# 2-86 劫财坐官库，有权无名。晚年有损财之忧。
# 1-155 官入墓，早退休好，不利官吏

甲子日乙丑时，连珠得合妻贤子贵。春月身旺，财帛破散。夏月甲衰，金神有制，贵。秋生，近侍之贵。丑月最吉，亥、子多凶。`,
	"甲日丙寅": `六甲日生时丙寅,时居日禄坐食神; 旺壬不见无刑破,福寿康宁富贵人。
甲日丙寅时,甲木寅上健旺,丙为食神,寿星得地,柱无壬夺癸克,通火木月气者贵,忌见官星及申冲禄。
# 月柱有财官：巳午申酉，家财富有。
# 1-155 吉利，恐子女干权。

甲子日丙寅时,日禄居时,青云得路,年月无庚辛金,贵;通木火气极贵。午月行东北方运,五六品贵。`,
	"甲日丁卯": `六甲日生时丁卯,伤官羊刃真当恼; 纵然月气有扶持,未免为人性不好。
甲日丁卯时,伤官羊刃,甲用辛为官,丁字伤之,用巳为财,卯中乙木劫之,主为人凶狠。
若柱透辛,伤官见官,刑害百端,运气凶险,不得善终;柱有七煞合刃,行财官印绶,大贵。
# 时上阳刃、即使是佳命：阳刃驾杀，也没有祖业且对妻不利。
# 1-155 羊刃，不得父产。

甲子日丁卯时,克剥悭吝,作事进退,不免刑伤妻子,或死他乡。生辰戌丑未月,贵。卯月凶,柱有官煞制亦吉。`,
	"甲日戊辰": `六甲日生时戊辰,天财坐库会滋身; 富商巨贾田园盛,月带辛金名利成。
甲日戊辰时,天财坐库,时上偏财,遇龙守库,主为商贾发财,田园广盛。八月带禄,财官俱有,富贵双全。忌比肩、羊刃夺财。
# 偏财坐印，生于夏季、有辰调候，佳命。
# 1-155 印库，50以后得权。

甲子日戊辰时,主移根换叶,改姓易宗,妻贤子孝,作高命论。未月,行北方运,贵。酉月,北方运,大贵。`,
	"甲日己巳": `六甲日生时己巳,病中财物实难任; 月通火气方为贵,若是身衰亦不禁。
甲日己巳时,食旺身衰,甲木巳上病,虽有暗戊为财,丙为食,不通月气,难任其福。
甲己为平头煞,生逢春月,身旺财衰,主骨肉参商,平生作事,弄巧成拙。己巳金神有火制伏,巳酉丑合局,行南方运,名重禄高。柱不见火,残害化气,主凶恶暴亡。
# 晚年合财，财旺，合而有散，心地淳厚。
# 1-155 得妻助，不是祖留产业。

甲子日己巳时,先贫后富,祖业轻微,妻勤子拗。生寅未巳丑年月,虽贵防疾。申子辰戌,大贵。`,
	"甲日庚午": `六甲日生时庚午,死处又遭鬼当头; 丁丙不逢生再弱,忙忙贫苦度春秋。
甲日庚午时,死地逢鬼,甲木死于午,午头见庚为鬼,不通月气,无救助者,带疾寿促。月逢丙寅,身旺庚绝则吉,亦主有始无终。若通木气,主方面,通水气,行东方运,止郎官。
# 日时干对冲、七杀生财，晚年自力更生，一生辛劳而有结果。
# 1-155 自己努力成，中年大败后得妻助。

甲子日庚午时,时日相冲,忧伤妻子,平常。若子午年月及寅戌月生,行西北方运,金紫风宪。`,
	"甲日辛未": `六甲日生辛未时,官星坐贵最为奇; 月逢金气须荣贵,财禄相停敢断之。
甲日辛未时,时贵逢官,甲见辛为官,未有天乙贵;己为财,未中己土得气,若通木气月,有寄托者富;通土气月者,富贵双全。
# 正官坐天乙，晚年大吉。
# 1-155 官坐天乙，不是大官就是清闲有福。

甲子日辛未时,辰戌丑未及己酉月,土金地方,文贵显达。`,
	"甲日壬申": `六甲生时遇壬申，明伤暗鬼坐其身；柱无丙戊秋冬旺，坎坷飘流无定人。
甲日壬申时，甲木绝在申，申土壬水长生，庚金建禄，明袅暗鬼，甲旺化鬼为官，犹不免凶暴。若生秋庚旺，生冬壬旺，柱无丙戊制伏，漂流之象。若巳午月，大吉。强横透庚，作煞论，运行北方，贵。
# 杀印同根在申，另透七杀，杀印相生。若再透壬或癸、化杀为印、多变、辛劳。
# 1-155 偏印日引绝，为日常生活辛劳奔波。

甲子日壬申时,申子辰亥月,水泛木漂,移根换叶,玉堂金马之贵。水土运,凶。`,
	"甲日癸酉": `六甲日生时癸酉,暗官明印未希奇；柱中有火无刑破，元命胎生贵可知。
甲日癸酉时，胎生元命，甲木酉上受胎，为甲生气，明癸为印，暗辛为官，有己土破印，不贵。酉为金神，若柱有寅戌，通火气者，德性纯厚而贵。无火见水，凶暴残疾。
# 秋官印双清、其他月晚年清秀名士。
# 1-155 官印相生、公正清闲，财力平常。

甲子日癸酉时,春生木旺;酉月官纯,贵。若混之以煞,或煞多,柱中全无火气,凶。`,
	"甲日甲戌": `六甲日生时甲戌,木遭火局气不舒;为了好善福平常,父母并伤诚可。
甲日甲戌时,甲用丙为食,辛为官,戌上食神入火局,辛有余气,身被火焚,为人好善,平常衣禄。甲以戊为父,癸为母,戌上旺甲伤戊,内有暗戊伤癸,戊癸受克,难为二亲。
# 戌月四现伤官入库，自由无依。
# 1-155 伤官入库，父母不全。

甲子日甲戌时,春寿,夏暴,秋贵,冬,移根换叶,柱见纯亥夹角,虽贵终凶。辰戌丑未,杂气财官,亦吉。`,
	"甲日乙亥": `六甲日生时乙亥，羊刃反伤为祸害；财官辛戊不相逢，只恐功名不亨泰。
甲日乙亥时，甲木亥上长生有旺，乙为刃，制克学堂，壬为倒食，亥上建禄。甲以金为官，戊己为财，辛金沐浴，戊己衰绝，不能作福。生巳酉丑月及见辛，柱有戊字，贵。余虽聪明，功名不遂，艺术人也。
# 劫财坐亥中比肩、一生不适合名利之争。
# 1-155 最忌入官场，远离权力为佳。

甲子日乙亥时,成趋乾格,贵。如生申月,煞旺合刃,权贵。酉月正官,柱稍得土助,大贵。辰巳丑未戌月俱吉。`,
	"乙日丙子": `六乙日生时丙子，伤官坐贵福不全；柱中不见官刑破，方是平生贵禄缘。
乙日丙子时，六乙鼠贵。乙用庚为官，死于子；见丙为伤，丙暗邀辛化煞为权，柱中不见庚辛，无丑绊午冲，方成格，贵。若有上忌及不通月气，无救助者，暴恶贫下，有疾寿促。
# 1-155 双妻，事业辛勤晚年有成。

乙卯日丙子时,高。辰戌丑未亥年月,不见官星,贵。`,
	"乙日丁丑": `六乙日生时丁丑，食神相助遇财官；月通金气化为福，不是寻常下贱看。
乙日丁丑时，食会财官，丁为食，庚为官，己为财，丑中有辛金合局，己土得位，如有倚托者，贵。通金气月化者，富厚尊重；不通月气，平常。
# 1-155 杀入库，子女体弱。

乙卯日丁丑时,亥月,身旺见辛偏官,柱有丁制,风宪武职。`,
	"乙日戊寅": `六乙日生时戊寅，败财背禄实伤身；有心无力多成败，止是平常衣禄人。
六乙日戊寅时，败财背禄，乙用庚为官，寅中有丙，伤官背禄；用戊己为财，寅中甲旺财败，为人作事成败平常。通土气者吉。
# 1-155 中年不顺，晚年有成。

乙卯日戊寅时,刑中发福。秋生贵。酉年遇辰戌丑未月,富。卯月建禄,午月印生,透官印,俱吉。`,
	"乙日己卯": `六乙日生逢己卯，时居日禄财临好；旺通木气贵无疑，金重亦可恼。
乙日己卯时，禄入庙堂，乙木逢卯建禄，为人秀丽，通木火者贵。见庚辛为伤禄破命，患目疾。若生巳酉丑月，平常衣禄。辰戌未，吉。申月亦吉。
# 1-155 中年以后夫妻不和，家运不佳。

乙卯日己卯时高,春生旺,为僧道,富足。夏平常,不见辛金,吉。秋带疾。冬温厚。卯丑年月,显达高寿。`,
	"乙日庚辰": `六乙日生时庚辰，水白金清化象真；壬从辛酉通官贵，却防目疾减精神。
乙日庚辰时，妻贤子贵。乙合庚化金，若通申巳酉丑月，为人秀丽，主贵，却防目疾。如不见化，以壬为印，庚为官，辰土癸水合局，乙木有托，行东南运，贵显平和。
# 1-155 无名位，有实权。

乙卯日庚辰时,富贵。通火土年月,大贵。`,
	"乙日辛巳": `六乙日生时辛巳，金木交争主不仁；有化月中身旺贵，不通无化恐伤人。
乙日辛巳时，暗金交争，是非日有，若通身旺月，有倚托，化鬼为官，行身旺运，贵。通木气月，行金旺运，大贵。通金气月，行身旺运，亦贵。
# 1-155 双妻，不易相处。

乙日时逢辛巳，破财倒食难通。双亲雁侣且和平，妻子无嗔无闷。`,
	"乙日壬午": `六乙日生时壬午，印绶生身财食聚；月通水木禄丰盈，不通月气平常数。
乙日壬午时，印绶学堂，乙木长生在午，见壬为印，用丁为食，己为财，午上丁己建旺，若通水月气者，文章秀丽；不通月气，平常衣禄，通运亦好。
# 1-155 有偏财，也有女缘

乙卯日壬午时高,丑月,入杂气财官;申酉月,身煞两停,俱主显贵。`,
	"乙日癸未": `六乙日生时癸未，入墓之中遇倒伤；马劣财微食见克，一生衣禄主平常。
倒食食神，己土偏财，破癸癸倒未中丁火之食，平常衣禄。通土气月则吉。
# 1-155 日墓，夫妻反目不易相处。

乙卯日癸未时,改祖离亲,就妻为家。午未年月,贵。春尤贵。`,
	"乙日甲申": `六乙日生时甲申，官星得印位生成；月中通气无冲破，必定荣华仕路人。
乙日甲申时，官印生身，乙用庚为官，壬为印，申上庚旺壬生，身有寄托，通金水月运者贵；不通，身弱官重，虽贵不永。
# 1-155 为他人谋事有成，自己财利平常。

乙卯日甲申时,化贵。月通水气无伤破者,贵,不然,富。`,
	"乙日乙酉": `六乙日生时乙酉，得逢金局火为奇；用神遇木重重见，鬼绝寿伤反无依。
乙日乙酉时，身绝鬼旺，乙以辛为鬼，酉上辛旺乙绝。若通巳酉丑月，化金局者贵。如用神坐木，身旺不化，又见于酉，不夭必贫。
# 1-155 坐绝逢绝，见好就收，早日退休。

乙卯日乙酉时,月通金局者贵。未寅年月,官至一二品。`,
	"乙日丙戌": `六乙日生时丙戌，鬼败临身有损伤；若不气通身旺月，孤贫劳碌苦难当。
鬼败临身，戌中有辛余气、丙丁库，食神制煞，若柱透庚，伤官见官，为祸百端；年月有寅午三会，丙火合局，即一木叠逢火位，主人傲物气高，衣禄平常，残疾，不然寿促。通身旺月气者，吉。
# 1-155 自信过度，孤独人缘不佳。

乙卯日丙戌时,寅卯月,运西运,六七品贵。子月印绶;丑月杂气,刑出财官,俱贵。`,
	"乙日丁亥": `六乙日生丁亥时，食神印绶亦奇哉；月气水土无财贵，切忌伤妻与子灾。
乙日丁亥时，死处逢生，乙木死，亥却气壬水为生气印绶，乙用丁为食，亥中丁坐无气，喜甲木生，助丁食为福。如遇金局，行水运者，防目疾。四柱见财，或行财运、贪财坏印，主破财。戊为财为妻，庚为官为子，亥上庚绝土病，妻衰子少。
# 1-155 中年守成，晚年修道治学。

乙卯日丁亥时,巳酉丑月偏官,申月正官,俱贵。亥月,东南运,风宪。未月,三合木局,大贵。`,
	"丙日戊子": `六丙日生时戊子，财官生旺遇食神；月气相扶为最贵，身衰夫倚是常人。
丙日戊子时，官旺财生，丙用辛为财，癸为官，丙合辛，戊合癸，子中癸旺辛生，丙火无气。若通火气，月有倚托者贵；不通贫下。通木气亦吉。
1-157 一生吉祥，少病有寿。

丙子日戊子时,寅巳卯未月,木能生火,大贵。冬月,丙火无气,贫夭。戌月,行火土运,五六品贵。`,
	"丙日己丑": `六丙日生时己丑，官鬼相生禄不成；若见申庚并乙旺，不求财禄过平生。
丙日己丑时，伤官背禄，傲物志高。丙用癸为官，丑中有癸余气，被明暗土伤，柱透癸为祸。若见庚辛，伤官生财，却为福庆。
1-155 伤官能生财，一生不得清闲。

丙子日己丑时,寅亥申辰年月,天干透财印食者贵。`,
	"丙日庚寅": `六丙日生时庚寅，学堂生气助其身；运中有合通金局，必是荣华富贵人。
丙日庚寅时，生气学堂，丙寅上长生，文章秀气；丙以庚辛为财，寅上庚绝丙旺。若通月气金局者财旺，富贵双全，喜西方运；不通局者财薄。
1-155 时上偏财，白手起家。

丙子日庚寅时,生子月,近贵。癸酉月,行水木运,高贵;火木运,五品以上贵。`,
	"丙日辛卯": `六丙日生时辛卯,旺木双妻为人巧; 不旺化水死乡中,色欲随身多爱好。
丙日辛卯时,败财逢合,丙日卯上沐浴,见辛合神。若身甚旺不得化者,只是为人无礼而贪色欲,却好如身弱化水,卯上水死,秀而不实,为人惯巧虚诈。惟丙午、丙寅、春月生,身旺不化者,文贵显秀。
1-155 财坐印，中产吉祥。

丙子日辛卯时,子卯相刑,伤妻害子。年月同,主魁名,近侍之贵。寅、午、丑、戌、天干地支俱合者大贵。`,
	"丙日壬辰": `六丙日生时壬辰,煞星坐库火难亲; 身强反主为官贵,如弱定为贫夭人。
丙日壬辰时,水火未济。丙见壬偏官,辰上壬水合局,火死无光。若生春夏,身旺化鬼为官,复行身旺运,贵。秋冬,身衰鬼旺,更无倚托,贫下残疾。
1-155 夫星时库，晚年独居。

丙子日壬辰时,辰戌丑未月,偏官有制,吉。亥卯年月,富贵。寅午,行子运;子,行寅午运,俱贵。不然僧道。`,
	"丙日癸巳": `六丙日生时癸巳,日禄归时又遇官; 不见巳寅壬癸月,功名唾于得何难。
丙日癸巳时,日禄归时,丙火巳上见癸为正官,坐贵。柱无壬己并寅亥,冲刑者贵,有则否。官通水旺,丙通木旺,无有不贵。
1-157 官坐禄，不受祖产，自身有寿。

丙子日癸巳时,丙禄在已,癸禄在巳,互换禄马,岁月无壬已寅亥冲破,近侍风宪,位至公侯。`,
	"丙日甲午": `六丙日生时甲午,格入伏晶要见土; 乐逢戊巳最为祥,火炎太过多辛苦。
丙日甲午时,丙火午上太旺,要见己合甲化土,火气伏晶,明照四方,若不见土难享福。生辰戌丑未月,上伏火气,造化得中贵。年月干上再透戊己,运行金水,贵;不透,通土气运亦贵。通,忌刑破。
1-155 羊刃在时，不聚财。

丙子日甲午时,春生吉;夏无依,秋财旺,冬官贵,少子晚成,火土运发达。`,
	"丙日乙未": `六丙日生时乙未,火托木局生有气;衣禄安稳且如常，运见水兮方得地。
丙日乙未时,生气印绶,丙见未为印库,若通火气月,贵;不通,柱无财,不行财运,亦作高命论,见则贪财坏印,主平常。冬生,官旺辅印,贵显。
1-155 正印入库能吏为他人办事

丙子日乙未时,春,印绶稳厚。夏平稳,秋反复,冬贵,岁运同。`,
	"丙日丙申": `六丙日生时丙申,身衰财破比肩分; 暗中鬼旺七煞地,无救何能家道殷。
丙日丙申时,财旺身衰,丙逢庚为财,壬为鬼,申庚旺壬生,丙火无气,财须比肩分夺。若不通身旺月者贫下;有倚托救助,又通身旺月,运再同,贵。
1-155 家运不吉。

丙子日丙申时,若通火气及寅卯月再行身旺运,吉。年月纯金,弃命就财,亦以吉论。`,
	"丙日丁酉": `六丙日生时丁酉,刃生身死为灾咎; 柱中无救定然凶,就财弃命难长寿。
丙日丁酉时,刃生身死,丁为刃,辛为财,酉上辛旺丙死,丁火长生,就财弃命,若无救助,不通身旺月,刃神不见刑冲,为人凶狠,不明礼义,有始无终;通月气,或有救助,为技艺便巧之流。癸卯月生者,癸能破丁刃为官,癸水卯上长生,卯中有旺乙为印,如用神有力,又行水木运,贵显。
1-155 得妻助，出生平常。

丙子日丁酉时,春稳,夏贵,秋平,冬吉。未申酉亥年月,大贵。有丑会子,有辰会酉,俱以贵论。`,
	"丙日戊戌": `六丙日生时戊戌，火局之中遇食神；月气火通为福寿，不通逢吉亦常人。
丙日戊戌时，寿永，名利不失。寅亥卯未印及申酉戌已年月生，贵。丙寅日戊戌时，庙堂食神，丙以戊为食神寿星，戌上丙火入库，戊土专位，若通火气月及东南运，福厚有寿；不通，平常。
1-155 劫财库，谨防女小人引起夫妻失和。

丙子日戊戌时，寿永，名利不失。家亥卯未印及申酉戌已年胜，贵。`,
	"丙日己亥": `六丙日生时己亥，亥中壬旺被己伤；若通月气方为贵，寅卯不逢主泛常。
丙日己亥时，鬼旺身绝，丙见己为伤官，壬为正鬼，甲为倒食，亥上有明己，旺壬生甲，丙火绝气，若通身旺月有倚托者，化鬼为官，主贵，终亦凶狠。通身旺运亦贵；身弱无倚托，不通月气，柱中透出壬字，为祸百端，傲物气高，主平常。
1-155 中年过后，及早退休。

丙子日己亥时，秋冬，平常。未月，行水木运，干透木火者，贵。子月，行东运，大贵。申、亥、丑、戌年月，亦贵。`,
	"丁日庚子": `六丁日生时庚子，身衰鬼旺暗中藏；月无救助多贫夭，得坐身强又吉昌。
若通身旺月，有倚托者贵，更行身旺运，大贵；反是，贫夭下贱。
1-155 时支七杀，难有亲属眷顾。

丁丑日庚子时平,通木火气,或行身旺运,贵。亦有亥子年月贵者,以丁火阴柔,不怕水乡故也。`,
	"丁日辛丑": `六丁日生时辛丑,库中财谷多陈朽; 身无依倚不为凶,有托妻贤而富厚。
丁日辛丑时,丑为财库,辛为妻财,已为食神,丑旺金局,暗己得位,丁火无气,若失天时无倚托者,就妻而发;有倚托救助者,财食丰足。
1-155 偏财入库，有意想不到的暗财。

丁丑日辛丑时,申酉月,财格,财旺生官,贵。午月,伤财身旺,主官禄。纯子寅,武贵三品。水月,艰辛劳苦。辰月贵戚。`,
	"丁日壬寅": `六丁日生时壬寅，身去从官化木神；水木月通成局象，尊荣安富贵无伦。
丁日壬寅时，身去从官，丁壬化木，寅上健旺，若水局之月，大贵；通木月亦贵。如丁未月，行东方运，好。
1-155 无刑冲，可入仕途。

丁丑日壬寅时化贵。生冬月,官旺,贵。春,印绶,安稳,夏吉;秋平,行东运好。`,
	"丁日癸卯": `六丁日生时癸卯，鬼旺身衰困不禁；倚托月通方论福，不然贫下苦悲心。
乙为倒食，卯上癸生乙旺，若有倚托救助及身旺月，化鬼为官，吉，柱无运通亦吉；反此贫下，失明血疾，妻灾子少。
1-155 女夫子俱伤。

丁丑日癸卯时,辰戌丑未月,制伏得中贵。午月干强,贵。申丑,风宪。`,
	"丁日甲辰": `六丁日生时甲辰，官星得位印生身；不通月气平为福，有倚扶同禄贵人。 --有误，应该是杀
丁日甲辰时，印绶官库，甲为印，壬为官，辰中甲木印绶生身，官星合局，若通月气，有倚托者贵，否则平常。春生，喜北运；冬生，喜南运，吉。
1-155 印坐杀库，必得重权。

丁丑日甲辰时吉,亥子月,富贵。申月,东方运;午月,金水运,俱贵。纯寅,风宪极品。`,
	"丁日乙巳": `六丁日生时乙巳，伤官暗里会枭神；东方运地成虚秀，金水之乡禄贵人。
丁日乙巳时，丁以壬为官，乙为倒食，巳上壬绝，有明乙倒食，暗戊伤官健旺，为人傲物志高，平常。若通金水月气，贵。运通亦贵。
1-155 中年以后不适合再发展。

丁丑日乙巳时,春富,夏孤,秋吉,冬贵。`,
	"丁日丙午": `六丁日生逢丙午，日禄喜居时上遇；柱中鼠兔癸无伤，少年腾达青云路。
丁日丙午时，青云得路。丁火午上建禄，若支无枭破，干无癸刑，禄元纯粹，主贵。如支有子卯，干有癸破禄，遇而不遇。
1-155 劫财，到老都在奔波。

丁丑日丙午时平,寅卯戌未年月,贵。酉丑,用财最吉。忌亥子官煞。`,
	"丁日丁未": `六丁日生时丁未，火托木局生有气；衣禄安稳且如常，运见水兮方得地。
丁日丁未时，火托木局，丁以甲为印绶，未为木库印绶之乡，若柱不见财星，不行财运，月年通亥卯未局，有倚托者，安稳之福。
1-155 女命大忌，六亲无靠。

丁丑日丁未时,丑未刑冲,不得善终。年月辰戌,四库全,贵当极品。申未,三品,法司淡薄清闲。`,
	"丁日戊申": `六丁日生时戊申，天元背禄败其身；月无救助财难发，只是平常衣禄人。
丁日戊申时，身败背禄，丁以壬为官，申上见戊土伤克，若年月干透壬，见官为祸，虽有旺庚为财，自败不能制克，不通身旺月者平常。喜甲寅年月，忌壬子。
1-155 伤官生财，晚年大富。

丁丑日戊申时,秀贵。未申年月,贵;行东南运,大贵。巳月,西北运,六卿之职。`,
	"丁日己酉": `六丁日生时已酉，学堂遇贵格诚稀；妻子有气食神旺，无破无刑方是奇。
丁日己酉时，丁火酉上长生，学堂、天乙贵人皆兼得之。丁用己为食，辛为财，酉上明己暗辛生旺，文章秀丽，如见卯乙冲破者不贵。
1-155 偏财双妻，有财难守久。

丁丑日己酉时,辰巳午未申戍年月贵。`,
	"丁日庚戌": `六丁日生时庚戌，墓中逢败难成福；若无救助鬼来伤，财帛不聚伤其目。
丁日庚戌时，墓中逢败，丁以庚辛为财，戌中有丙为败，不成其福。若无救助，叠见癸水，主伤目。
1-155 正财坐劫，一生时好时坏。

丁丑日庚戌时,时日相刑,忧伤妻子。若寅亥申酉年月,官至三品。午未子辰,行金木运亦贵。`,
	"丁日辛亥": `六丁日生时辛亥，财官双美印长生；若通月气极高贵，月不通兮名利轻。
丁日辛亥时，财官双美，丁用壬为官，辛为财，甲为印，亥上有明辛为财，暗壬为官，生甲为印，若通火气有寄托者，大贵，有全美之名；不通，名利乖劣。
1-155 时干偏财，到老亨通。

丁丑日辛亥时,秋财旺,夏身旺,春印旺,贵显。冬,官煞太重,恐身弱不能胜任其福。`,
	"戊日壬子": `六戊日生时壬子,月通四季墓中财; 若交身化为真火,水旺运乡忌目灾。
戊日壬子时,妻财俱旺,戊以壬为妻财,子上壬水旺,戊土无气,生辰戌丑未月,不化者获财。若合癸化落水旺乡,火不显其光,作事无成,虚而不实,当患目灾。通月气旺者贵。
1-157 时坐财旺，先败后成。

戊子日壬子时,财星格。寅卯月,禄马朝元,显贵。酉亥丑年月,西北运,金紫风宪。`,
	"戊日癸丑": `六戊日生时癸丑,却去从妻成配偶; 为人性巧甚聪明,尤好风流嗜花酒。
戊日癸丑时,戊以癸为妻财,丑中有癸余气从财,癸旺,若通月气化为真火,为人聪明;若通土气,主富贵,操权。夏月,行东方运,贵显。
1-157 双妻，多有不动产。

戊子日癸丑时,戊月生,杂气印绶,天干透丙丁字,不必格局,主富贵。`,
	"戊日甲寅": `六戊日生时甲寅,病中又被鬼伤身; 月气若通身旺吉,日干衰弱夭亡人。
戊日甲寅时,身衰鬼旺,寅中甲建禄,丙生身,如通身旺月,有倚托有救助,化鬼为官,主富贵;反此贫夭,行身旺运亦吉。
1-157 个性太强而减福、清孤。

戊子日甲寅时,先破后发,贵。未月生,干有制伏,贵。午月无制,聪明近贵。`,
	"戊日乙卯": `六戊日生时乙卯,四柱伤官不见好; 辛申弗逢冲害无,管取功名直到老。
戊日乙卯时,官强身弱,戊用乙为官,卯上乙旺戊死,若无倚托,不通月气,身弱化官为鬼,纵贵寿夭;若通月气,身旺有托,柱中不见申酉辛庚、伤官甲木破命者贵显。
1-157 如孤官无辅，清闲。

戊子日乙卯时,时日相刑,伤妻害子,自成自立。年月再遇,主风宪。午酉,四正全,大贵。`,
	"戊日丙辰": `六戊日生时丙辰,宝藏财库利于身; 无伤无破何须问,禄马相扶富贵人。
戊日丙辰时,官藏财库,戊用壬癸为财,乙木为官,丙为倒食,辰上丙火无气,壬癸入库,乙有余气,若有倚托通月气者,贵显。
1-157 父母无缘（特定条件），守财简朴。

戊子日丙辰时,春生近贵。夏辛苦。秋,权高寿促。冬财,通火土,有倚托者贵。`,
	"戊日丁巳": `六戊日生时丁巳,印生日禄喜归时; 财官不见刑冲破,早际风云会遇期。
戊日丁巳时,印绶遇禄,戊禄居巳,见丁为印,巳上丁火帝旺。年月支干不宜见财官,见官损禄,见财损印。不见官煞,不行财官,行食伤印运,高贵。忌刑冲破害。
1-157 比坐旺，妻先亡，独身治学。

戊子日丁巳时,贵。子月正财,土厚地方,显达。亥丑年月,官居极品,内臣中,富贵双全。`,
	"戊日戊午": `六戊日生时戊午,为人凶狠性多刚; 月中化火居官吉,破害刑冲却是良。
戊日戊午时,刃神重叠,戊以午为刃,性狠多刚,如见刑冲破害,刃神受制,通月气者,为边疆武职。月中有化气得天时者,大贵。
1-157 双妻，一生多是非小人。

戊子日戊午时,巳寅戌月,风宪。夏不熔铸,先刑后发,旺处多官。灾破祖。`,
	"戊日己未": `六戊日生时己未,羊刃偏官不怕冲; 但是为人多性狠,平生衣禄亦无凶。
戊日己未时,羊刃偏官,戊以己为羊刃,甲为偏官,时上明暗二己为刃,甲木未中合局,若见刑冲破害,刃煞有制,主贵。通月旺者平常衣禄。
1-157 父母无缘（特定条件），晚年谨慎守成。

戊寅日己未时,先难后易,贵人提携,不贵即富。年月透甲制刃,地支午未身旺,煞刃双显,主大贵。`,
	"戊日庚申": `六戊日生时庚申,干上食神喜相亲; 不见卯寅兼甲丙,何忧玉带不荣身。
戊日庚申时,戊以庚为食,壬癸为财,申上庚旺壬生,戊土有气,无丙火夺食破财,再无寅巳刑冲,生秋月大贵。
1-157 中年起伏不定，50岁以后佳。

戊子日庚申时,若生亥子月,亦是合禄,贵。`,
	"戊日辛酉": `六戊日生时辛酉,伤官暴败怕时逢; 柱中纵有财星助,有子不成命早终。
戊日辛酉时,身败伤官,戊以乙为官,辛为伤官,酉上辛金旺,戊土沐浴,为人性傲行卑。年月透乙,为祸百端;如有乙再行官旺运,刑害不吉。若通生气月,行北运,不贵即富。
1-157 女命大忌，夫先亡。伤官原因。

戊子日辛酉时,巳酉丑月,伤官伤尽,行财旺运,武职风宪。`,
	"戊日壬戌": `六戊日生时壬戌,身居正位见天财; 若生秋月通身旺,万贯家资不用猜。
戊日壬戌时,专位逢财,戊以壬为财,戌上水冠带。春夏壬水无气,财帛不旺;冬则大旺,土虚身弱不能驱驾;惟秋后戊土坚厚,财命有气,富贵。
1-157 中年极为辛劳，晚年发。

戊子日壬戌时,酉申戌月,家财满目。辰、丑冲刑库开,俱吉。`,
	"戊日癸亥": `六戊日生时癸亥,化火无戌战水乡;若见乙庚丁丑无,反为官命不寻常。
戊日癸亥时,戊合癸化火,火绝于亥,战于水乡,不成其象,为人虚秀,多是九流艺术近贵之人,主患目疾。若年月干头见乙丁庚旺,为三奇之贵;通土气月身旺,行火木运,吉。
1-157 首妻不能偕老，晚年有财。

戊子日癸亥时,年月不见戊字破格,贵。申子年月,东南运;亥卯,南运,俱贵。巳午未旺,大贵。`,
	"己日甲子": `六己日生时甲子,明见官星暗有财; 倚托若通于月气,平生衣禄自天来。
己日甲子时,明官暗财。己用甲为官,癸为财,辛为食,子为天乙贵,子上有明甲暗癸,辛长生。身若有倚托通月气者,富贵;若不身旺,行土气运,亦好。
1-157 偏财干合，多有女缘，晚年大富。

己丑日甲子时,化贵,午寅年月,夭折;通土气月,贵。`,
	"己日乙丑": `六己日生时乙丑,煞星受制不为伤; 柱中身旺多荣贵,无助生人昼夜忙。
己日乙丑时,专财逢鬼,丑上有明乙为鬼,暗癸为财。若有倚托通身旺者,贵;通运亦吉。若鬼有助,旺不能任者,衣禄平常。
1-157 劫、杀临库，非商业人士，适合宗教。

己丑日乙丑时,时上偏官,居武职都阃,还看地方断之。卯月金水运,六七品贵。`,
	"己日丙寅": `六己日生时丙寅,暗官明印旺其身; 月通木气无冲破,贵倚三台八位成。
己日丙寅时,官印生旺。己用甲为官,丙为印,寅上甲旺丙生。如果无破、通木局月气者,大贵。喜行木火,不宜金水。
1-157 女命大忌，子女有伤。

己丑日丙寅时,春官旺,夏印旺,秋既济,冬平。辰戌年月,文贵显达。纯丑,寿高。`,
	"己日丁卯": `六己日生时丁卯,支干暗鬼枭虚神; 柱中有助方为福,无助难为显达人。
己日丁卯时,己以丁为印,乙为鬼,卯上明丁暗乙。若岁月中无救助倚托者,虚秀不实,有成有败。月中见辛制伏身旺者,贵;运旺,亦吉。
1-157 独杀坐时，性格孤独，好文艺。

己丑日丁卯时,申子辰,武职。亥卯未,荣富。巳酉丑,行东北运,吉。`,
	"己日戊辰": `六己日生时戊辰,其身得位遇财神; 田园富贵多诚信,甲乙提纲禄贵人。
己日戊辰时,财库专位。已以壬癸为财,辰上入墓,己土专位。为人诚信富贵。若通月气或甲乙透出,是生月带禄、大贵。
1-157 父母无缘（特定条件）、有财、有外室。

己丑日戊辰时,身孤。寅卯月,禄旺。辰月透甲,作化气看,贵。午,富厚。寅酉,风宪。`,
	"己日己巳": `六己日生时己巳,金神与火两相和; 不通月气平常看,月气如通荣甲科。
己日己巳时,金火相合,己以丙为印,巳中有丙,健旺;己巳又为金神,坐于火位,相合。若通火月气,四柱不见财星破印,不行财遇,发福非常。
1-157 比劫同位，先失后得。

己丑日己巳时,辰月,西北运,贵。午未火旺,大贵。申子戌巳,亦吉。`,
	"己日庚午": `六己日生时遇午,禄归时地主昌荣; 柱中怕有官星见,若是伏晶另一评。
己日庚午时,日禄归时。已见庚为伤官,乙为正鬼;午上有明庚合乙,伤官合煞,主人独立有成。若年月无乙而伤官临于败地,柱有甲、丙二字,伏晶格,不损格局无冲破,主大贵。
1-157 财吉而体弱。

己丑日庚午时,寅月生,贵;夏凶;秋暴;冬,财旺子少。`,
	"己日辛未": `六己日生时辛未,食神官库喜相亲; 木通月气须言贵,月不通兮富命人。
己日辛未时,食神助官。己以辛为食,甲为官,未为官库,未上有明辛暗甲。若有倚托通月气,贵。食神生旺,胜过财官。
1-157 中年大起大落，晚年守成。

己丑日辛未时,不贵即富。通土气月,富。通木气月,贵。一云刑,凶。`,
	"己日壬申": `六己日生时壬申,损败天元气不全; 若失天元无倚托,非穷即夭命难延。
己日壬申时,水旺土虚,己以甲为官,壬为财,庚背禄。申上庚旺壬生甲绝,己土气败。若通四季土气或通土气运,吉。若失天时无倚托,不通月气,非贫即夭。
1-157 水土相克，有财，但有意外灾。

己丑日壬申时,酉年月,天干透印,富贵好礼,为人慨慷。辰戌吉。亥年,乾清坤夷大格。`,
	"己日癸酉": `六己日生时癸酉,沐浴之乡水土浑; 财食支藏多聚散,身衰失地寿难存。
己日癸酉时,水土浑浊。己以癸为财,辛为食。酉上癸病,辛旺,比肩夺财,财多聚散;更身衰失地,主成败反复;不然,寿促。若通身旺月或运,吉。
1-157 食坐禄，女命有贵子。

己丑日癸亥时,春平;夏稳;秋伤官伤尽,有威权;冬富。如丙寅巳月,金神遇火,贵。`,
	"己日甲戌": `六己日生时甲戌,妻从夫化为真土; 如通月气禄源深,反此而言平常取。
己日甲戌时,妻从夫化。己合甲木化土成局,土神钟秀、禄源深厚。月中无化,取甲为官,丙为印,戌土上甲木成形,丙火合局。通月气,贵;不通,有刑冲破害者平常,己身虽吉,父母早失。
1-157 父母无缘（特定条件）、宗教文艺人士。

己丑日甲戌时,克父太旺。辰月生,土厚。居巳午末申,临官、帝旺,吉。`,
	"己日乙亥": `六己日生时乙亥,官藏煞见未为奇;逢金制煞方为吉,身不旺兮凶可知。
己日乙亥时,煞见官藏。己以甲为官,乙为鬼。亥上有明乙暗甲,为官煞混杂。柱中见辛制乙,去煞留官;通月气者,贵显。亥上水旺土虚,漂流失业,见财不聚,成败进退。
1-157 克泄交加，晚年有慢性疾病。

己丑日乙亥时,巳酉丑月,制煞留官,贵。午月,身旺,亦贵。子月、火运、七、八品,贵。卯未,透辛制乙,大贵。`,
	"庚日丙子": `六庚日生时丙子，身鬼俱衰退神强；有托荣华无托贱，鬼逢生旺寿难长。
庚日丙子时，身鬼俱衰弱。庚以癸为伤，丙为鬼。子上庚死、丙火无气、癸水健旺。若身有倚托，吉；无倚托，又行身衰鬼旺运，飘风夭贱。通火气月，要行西运，贵。
1-158 时支伤，辛劳一世。

庚子日丙子时，贵。年月再子，并冲，飞天禄马格；柱无财官填实，主贵。`,
	"庚日丁丑": `六庚日生时丁丑，贵地逢官火太轻；木火运通轩冕客，不通独立只虚名。
庚日丁丑时，金重火轻。庚以丁为官，以己为印，丑上丁火气轻，己土正位。若通木火气月，官印逢生旺，贵；不通，虚名而已。
1-158 劫坐时支、六亲乏情。

庚子日丁丑时，春夏，贵；秋平常；冬孤克。`,
	"庚日戊寅": `六庚日生时戊寅，火生金绝福高人；月通从革或秋降，却做皇家柱石臣。
庚日戊寅时，火生金绝。庚以丙为鬼，戊为倒食。寅上有明戊、合癸化火，庚金气绝。若不通金旺月，无救助者，夭贱贫下。巳月身鬼俱强，运行西方，武贵。
1-158 偏印旺时支，九流艺术宗教。

庚子日戊寅时，纯子年月，飞天禄马，无破，六卿。巳酉，大贵。`,
	"庚日己卯": `六庚日生时己卯，胎生元命发因妻；柱中有托逢庚旺，财禄丰盈福寿齐。
庚日己卯时，胎生元命。庚金卯上受胎，见己为生气印绶。庚以乙为财，卯有旺乙，因妻发福。若柱旺丁，生月带禄者，贵；有倚托者，富。
1-158 二妻，一生守辛劳之业。

庚子日己卯时，子卯相刑，忧伤妻子，子年月，贵。丑未，官至三品。`,
	"庚日庚辰": `六庚日生时庚辰，金火秋生气象纯；若有魁罡包贵贱，财官喜忌六官分。
庚日庚辰时，金水清白。庚戌、庚辰为魁罡，怕见财官刑冲；不见，主粗豪暴勇而贵。其余庚日喜见财官，生秋月，不贵则富。
1-158 伤官库，生财相当辛劳。

庚子日庚辰时，申月生，井栏叉格。柱并运不见丙丁巳午寅戌字，贵。`,
	"庚日辛巳": `六庚日生时辛巳，偏官合刃自身生；为人刚毅妻财损，运到金乡贵禄享。
庚日辛巳时，阳刃偏官。庚以辛为刃，丙为杀。明辛暗丙，合煞为权。通身旺月，贵；不通，无贵，寿考。
1-158 劫杀在时，晚年方佳。

庚子日辛巳时，春富；夏、秋贵；冬贫。辰戌丑未年月，印绶，行西南运，贵。`,
	"庚日壬午": `六庚日生时壬午，官印福宫聚食神；金士助身须显贵，日逢火旺命难通。
庚日壬午时，官印健旺。庚以丁为官，己为印，壬为食。午上壬食无气，丁己禄旺。通金土月气扶身者，贵。通火气则官贵太重，须身旺运。
1-158 食官对合，中年可退休。

庚子日壬午时,时日并冲,忧伤妻子。通金气,贵。火气,大贵。`,
	"庚日癸未": `六庚日生时癸未，官星魁制权星退；柱中见己不透丁，却能显达得官位。
庚日癸未时，印财库。庚以乙为财，未上入库；己为倒食，丁为正鬼；未上有暗丁，己被明癸制伏。柱有己制癸，不透丁字，居官显达。
1-158 时财库，知足常乐小康生活。

庚子日癸未时,年月无丁透露,有己土制伏癸水者,贵。`,
	"庚日甲申": `六庚日生时甲申，归禄带财格最纯；巳丙与寅柱不见，功名富贵自然臻。
庚日甲申时，日禄居时。庚金申上见禄，甲为偏财。柱中不通丙火、巳寅冲刑，主贵有平常。岁运同。
1-158 偏财坐比，自由职业。

庚子日甲申时,时犯日禄,见财星,柱无巳寅丙,富贵双全。辰戌丑未土能生金,吉。`,
	"庚日乙酉": `六庚日生时乙酉，金中相会化真金；柱中无火多刚缺，有火相成贵气荣。
庚日乙酉时，气化真金。庚以乙为财，辛为刃，酉上财绝刃旺。若化真金，柱中无火则过刚；行火运，造化抑扬，得中道。庚辰日最好。
1-158 财遇羊刃，性刚孤独。

庚子日乙酉时,主富。月通火气,贵;不通,平常,运通亦称意。`,
	"庚日丙戌": `六庚日生时丙戌,金火持争事不详; 身旺月通印绶吉,不通无救祸难当。
庚日丙戌时，金火持争。庚以丙为鬼，丙火戊土合局，金无气。若通身旺印、卯月有救助者，贵；反是平常或夭贱。
1-158 官库，人口单。

庚子日丙戌时,春,偏官用财,吉。夏,煞旺身衰,凶暴。秋,身煞俱旺。`,
	"庚日丁亥": `六庚日生时丁亥,官星失地自身衰; 不通月气难成福,若见魁罡却妙哉。
庚日丁亥时，庚以甲为财，壬为食，丁为官。亥上丁火无气，壬旺甲生，庚金失地，难任财食。若通身旺月、阴土扶身者，发财。庚戌、庚辰魁罡日逢丁亥反贵。
1-158 夏冬吉，春秋差。

庚子日丁亥时,贵。申子辰月,伤官、劳碌。卯月、金火运、五六品贵。`,
	"辛日戊子": `六辛日生时戊子，印绶学堂坐食神；不见丙丁同午破，必是荣华贵显人。
辛日戊子时，六阴朝阳。辛金子上长生学堂，辛以戊为印，癸为食。柱中不见丙丁午字冲开；通身旺月，大贵。
1-158 时支食印相克，虚化命。

辛丑日戊子时,丑月,杂气财官,贵。纯丑,儒职。纯辰、行西运,都宪。`,
	"辛日己丑": `六辛日生时己丑，金土持争势不安；年月财官相救助，免交贫困受饥寒。
辛日己丑时，辛以己为倒食，丑上有明己暗辛。岁月无财官救助者，贫困；得财官运，亦吉。
1-158 时支劫库，六亲难靠。

辛丑日己丑时,孤浊滞生。申酉月,金旺,运行火乡,疏通,刑伤妻子;为僧道,贵。`,
	"辛日庚寅": `六辛日生时庚寅，财旺生官遇贵神；金木局中通月气，必为荣贵富豪人。
辛日庚寅时，辛以寅为天乙贵，丙火为官，甲木为财，寅上丙甲旺。若通金木月气或通运，主富贵显达。
1-158 劫、财同柱，先失后得，守成一生。

辛丑日庚寅时,春贵;夏官旺;秋显达;冬吉。丑月、南运,风宪或武贵。`,
	"辛日辛卯": `六辛日生时辛卯，妻子难为遇比肩；秋产冬生贫下格，丙临寅马却当权。
辛日辛卯时，比肩分财。辛以乙为财，卯上乙旺，遇比分夺，损伤妻子。生秋冬，财官无气，平常。寅巳午月，干透丙火，官贵显达。
1-158 坐绝逢绝，勉守最后基础。

辛丑日辛卯时,春、夏生土厚地方,富贵。秋,克妻刑子。冬、艰辛。`,
	"辛日壬辰": `六辛日生时壬辰，伤官伤尽倍精神；四柱火虚防克害，九流技艺卜医人。
辛日壬辰时，辛用丙为官，壬为伤官，辰为水库。若年月透丙，是伤官见官；不通月气、无倚托者，多为医卜艺术。柱有木火身旺，行东南运，贵。
1-158 食伤坐库，有才难发展。

辛丑日壬辰时,春,财旺,妻贤子孝。夏,伤官见官,然亦多富。秋吉。冬,孤克,多贵。`,
	"辛日癸巳": `六辛日生时癸巳，贵气无伤官印强；月气有通兼倚托，早年荣贵姓名香。
辛日癸巳时，官印扶身。辛以丙为官，戊为印，癸为食神。巳上丙戊健旺，癸合化火，若有倚托、通月气者，显达；若月不通，运通，亦贵。
1-158 食伤合官、子女吉祥。

辛丑日癸巳时,凶,别父母发福。春夏,吉。秋冬,凶暴。`,
	"辛日甲午": `六辛日逢甲午时，暗鬼枭神真可畏；若无倚托反劳生，莫道六辛逢马贵。
辛日甲午时，鬼旺身衰。辛用丁为鬼，己为倒食，甲为财。甲午木死则神无气，丁己健旺，虽见午为天乙贵，平生反复；纵通旺气，亦贵不永。若生火土月，西方运，贵。
1-158 财官坐实，清名胜财富。

辛丑日甲午时,未申年月,四柱有利害,虽富寿夭。通金,虽贵不永。`,
	"辛日乙未": `六辛日生时乙未，火木相成金不畏；月通金气与春荣，财旺生官身自贵。
辛日乙未时，天财入库。辛以乙为财，未上入库；己为倒食，丁为正鬼；未上有暗丁，己被明乙制伏。若通巳酉丑月者，贵；通火，行西运；通金，行南运，俱贵。
1-158 时为财库、败祖。

辛丑日乙未时,刑。亥卯未寅月,财旺生官不贵则富。辰戌丑子,俱吉。`,
	"辛日丙申": `辛日生时遇丙申，月通金火转精神；化成金水逢金地，聚福能为富贵人。
辛日丙申时，丙辛化水，申上长生。若月通巳酉丑金气者，精神秀丽，文章聚福。通火气旺、有倚托者，贵。辛酉、辛未最妙，不成化象时亦平常。
1-158 合官坐绝，晚年心灰意冷。

辛丑日丙申时,化贵。少年蹇剥,中贵显。亥月,作化气看。吉。`,
	"辛日丁酉": `六辛日生时丁酉，鬼破禄无祸百端；倚托身强方断吉，月通制伏是偏官。
辛日丁酉时，火金持争。辛金酉上健旺，见丁为正鬼；酉上丁长生，破禄，不成其福，反复成败。身强通月气有制伏者，作偏官论；更行身旺运，贵。
1-158 杀坐比，性刚自困。

辛丑日丁酉时,高平稳。酉月、土木运,方面。戌亥子巳未年月,大贵。`,
	"辛日戊戌": `六辛日生时戊戌，印绶生身坐禄堂；有托福人难靠祖，不通月气是平常。
辛日戊戌时，禄同印堂同居。辛以戌为禄堂，戌上有明戊为印绶；以丙丁为官，若有倚托通月气者，难为祖业。不通，平常。
1-158 七杀入库，父子面和心不和。

辛丑日戊戌时,刑害。辰戌丑未月,贵。寅巳,正官,贵。子午卯酉,武职风宪。`,
	"辛日己亥": `六辛日生时己亥，背禄剥官反破伤；如作飞天禄马贵，失时无合空忙忙。
辛日己亥时，飞禄合局。辛以丙为官，亥上有旺壬伤，故官无气；如再得亥月或亥日，以亥冲出巳中丙火为官星。若是辛西、辛丑合局，贵。
1-158 守成。

辛丑日己亥时,辰戌丑未及寅卯月生,作飞天禄马,贵。未月,金水运,金紫方面。`,
	"壬日庚子": `六壬日生时庚子，子上明庚暗损伤；火土月中仍主吉，不通凶狠只平常。
壬日庚子时，刃旺身强。壬以庚为倒食，癸为羊刃，时上明庚癸旺，若通火土月气，制伏庚癸，大贵；不通，凶狠平常。通运亦贵。
1-158 印坐刃，宗教艺术。

壬子日庚子时,辰戌丑未月,杂气财官;巳申酉丑,印绶,居土厚分野,俱贵。`,
	"壬日辛丑": `六壬日生时辛丑，下有官星上印绶；如通月气运西南，官印扶身人清秀。
壬日辛丑时，官印得位。壬以己为官，辛为印，丑上金局，暗己得位，若通月气，为人清秀，禄贵安稳；不通，主性僻诡谲。
1-158 印时支、亲人受拖累。

壬子日辛丑时,巳酉丑月,印绶,多受父母荫。申月,火土运,近侍有权。`,
	"壬日壬寅": `六壬日生时壬寅，水火相逢既济论；水木月通财禄贵，不通无救是常人。
壬日壬寅时，水火既济。壬用丙为财，甲为食，寅上丙生甲旺，壬水无气，若通水局，有倚托，皆贵，不通无救，福薄。壬寅日本身健旺，主大富。
1-158 通时根，先难后易。

壬子日壬寅时,纯子年月,飞天禄马,无破,六卿。巳酉,大贵。亥,亦贵。`,
	"壬日癸卯": `六壬日生时癸卯，引归死地势难安；劫财煞刃见伤鬼，倚托若无常命看。
壬日癸卯时，身死刃生。壬以癸为刃，卯为暗乙，而伤官鬼。卯上癸生乙旺壬死，不通身旺月气，无救助及倚托者，夭贱。巳酉丑月，印旺无化者，性僻孤高虚诈。
1-158 时为伤，女吉男孤僻。

壬子日癸卯时,子卯相刑,忧伤妻子,贵人提携,财帛盈余,敦厚之命。`,
	"壬日甲辰": `六壬日生时甲辰，壬骑龙背坐食神；柱中有托无刑害，必是荣华富贵人。
壬日甲辰时，亦为壬骑龙背。壬以甲为食神，辰上壬水合局，甲有生气，食神旺相，通月气者富贵福厚。冬月行卯运不利。
1-158 坐劫库，受手足累。

壬子日甲辰时,纯子年月,飞天禄马,无破,六卿。巳酉,大贵。亥,亦贵。`,
	"壬日乙巳": `六壬日生时乙巳，身绝有财不聚财；进神暗鬼来相克，透己相刑是祸胎。
壬日乙巳时，财旺身绝。壬用丙为财，戊为鬼，庚为倒食。巳上有乙木为伤官，丙戊健旺，庚金长生，壬水气绝。若不通身旺月无救助者，贫；有倚托，通旺，或行身旺运，皆吉。
1-158 财旺，中年后自立。

壬子日乙巳时,贵,但难为妻子,性格刚强,不受击触。戌年月,纯煞有制,行木金运,官至三品。`,
	"壬日丙午": `六壬日生时丙午，聚财之地坐胞胎；月逢金水须富贵，弃命从来是就财。
壬日丙午时，禄马三奇。壬以己为官，丙丁为财，午上丁己是禄马，壬水受胎，有倚托、通金水月气者，主富贵；通火气，亦贵。
1-158 双妻，妻有才能。

壬子日丙午时,公直撑持,孤高而贵。年月子午,字重,水火既济,极品。`,
	"壬日丁未": `六壬日生时丁未，夫化妻从格局奇；若是局中通水木，发财发福两相宜。
壬日丁未时，夫从妻化，壬合丁，未上同木局，贵。若月通木局，有倚托者发财，不通，但有资助，因妻致富。
1-158 中年后才能成家立业。

壬子日丁未时,月通木气,贵;通金气,富,通火土气,富贵;两全不通,行火土运,亦吉。`,
	"壬日戊申": `六壬日生时戊申，长生之地鬼伤身；身强制伏为高命，反此定知贫薄人。
壬日戊申时，水土混浊。壬以戊为鬼，庚为印，申上庚金健旺，壬水长生，戊土偏官，身鬼俱强。若通旺月、行身旺运，有甲木制伏者贵；不通则聪明而不贵。
1-158 女命大忌，子女不和。

壬子日戊申时,羊刃带煞,贵人提携。巳午年月,近侍有权。`,
	"壬日己酉": `六壬日生时己酉，明官暗印有扶持；月通身旺人清贵，犹恐恋花贪酒色。
壬日己酉时，败处逢生。壬水酉上沐浴，辛为生气印绶，酉上辛金旺，用己为官。若通月气有倚托，行财官运，贵；反是平常。但犯桃花坐命，风流人物，恋花贪酒。
1-158 晚年守成平安。

壬子日己酉时,春平,夏吉,秋常,冬旺。如卯月生,好花酒。`,
	"壬日庚戌": `六壬日生时庚戌，身临财库却为鬼；明庚暗戌相刑克，财禄生平聚散多。
壬日庚戌时，枭临财库，壬以丙丁为财，库于戌，庚为倒食，戊偏官。若通火木月气，有倚托者，贵；不通，财帛聚散。
1-158 财库守财，富而节约。

壬子日庚戌时,名利进退,庚辛年月,贵。辰丑,刑冲;酉月,破害,财库得用;巳午,财官旺,俱吉。`,
	"壬日辛亥": `六壬日逢辛亥时，印禄相随最是奇；财官不见无冲破，得路青云报尔知。
壬日辛亥时，日禄居时，无克破，有倚托，柱中不见财官，富贵显达；行东运，大贵；若通气，减福；南方运，不贵巨富。
1-158 中年后必须守成。

壬子日辛亥时,主父母不得善终,后发不富。亥卯年月,文章进身,大贵。`,
	"癸日壬子": `六癸日生时壬子，青云得路最为奇；若无己土冲克破，自有功名显达时。
癸日壬子时，日禄归时，癸水子上建禄，若年月干支无戊己午未字刑冲破害，三元有倚托，通月气者，文章秀丽，官职显达；通木气月亦贵。
1-158 劫比连根，双妻不和。

癸丑日壬子时,午寅、乙丑,己丑年月,文职四五品,通身旺木气月,无戊己午巳字,显贵。`,
	"癸日癸丑": `六癸日生时癸丑，支中暗鬼有刑伤；月通身旺防妻损，丑巳遥合贵异常。
癸以丁为妻，丑中丁火无气，若通身旺比肩之月，防损妻财。柱丑寅多，以寅刑巳，丑合巳，刑出巳中丙戊为财官，须干头无戊己字，大贵。
1-158 比库通根，夫妻互妨。

癸丑日癸丑时,丑遥巳中丙戊为财官,若生丑寅申子酉三合年月,主妻贤子孝,荣贵特达。`,
	"癸日甲寅": `六癸日生时甲寅，刃复官禄减精神；柱中无有庚申字，刑合财官是贵人。
癸日甲寅时，刑合财官，癸以丙为财，戊为官，寅刑出巳中丙戊为财官，若柱无官煞及刑冲破害损格，贵；有庚申戊己字，无制伏，不贵。
1-158 伤官禄，代他人理财。

癸丑日甲寅时,本贵,丑中有辛金,减其分数。纯水年月,官至一品。秋生印绶,亦贵。`,
	"癸日乙卯": `六癸日生乙卯时，长生之地遇食神；众无午酉兼辛巳，福寿双全禄位人。
癸日乙卯时，食神干旺。癸以乙为学堂食神，卯上癸水长生，乙坐禄，柱中无己破辛夺、午酉刑冲，通月气有倚托，主聪明有寿，居官食禄。
1-158 女命大吉，有好后代。

癸丑日乙卯时,辰丑月,高贵。一云:少贱中年贵。`,
	"癸日丙辰": `六癸日生时丙辰，偏官无气未为贫；若无木气通其局，定是清高福禄人。
癸日丙辰时，身坐官库，癸用戊己为官，辰上土墓为官库，见丙为财，辰为水局，丙火无气，癸水合局，柱无甲破官损库，主贵。
1-158 日库时支，守财简朴。

癸丑日丙辰时,平。辰戌丑未月,财官有气,贵。`,
	"癸日丁巳": `六癸日生时丁巳，贵地逢财遇暗官；有托就看财禄盛，无依必定福偏残。
癸日丁巳时，癸合财官，癸用丙为财，戊为官，庚为印，巳为天乙贵人。若有倚托，通水气月，贵，不通水气，平常。时逢三奇，多发于晚年。
1-158 财官旺，守业到老。

癸丑日丁巳时,先贫后富,行火水运,发达。`,
	"癸日戊午": `六癸日生时戊午，化火临时帝旺乡；运喜东南木火地，为官清正禄荣昌。
癸日戊午时，化气成火局，癸合戊化火，午上帝旺，合局而贵。身旺不化癸水者，贵而寿促，东方运吉。
1-158 晚年大发，得妻助。

癸丑日戊午时,财厚,南运主贵寿促,东运吉。`,
	"癸日己未": `六癸日生时癸未，鬼旺身衰福不齐；月气不通无救助，平常衣禄有相亏。
癸日己未时，鬼旺身衰。癸以己为鬼，未上明暗二己得坐专位，癸水无气，浑浊不清，反复成败，若通月制又不通水气者，平常。
1-158 杀通根，琐事多。

癸丑日己未时,高。年月俱丑,贫薄。辰戌丑未,土旺,主目疾、贫贱。通金木水气,贵。`,
	"癸日庚申": `六癸日生时庚申，官星印旺在其支；柱中无己丙寅巳，自有荣华富贵时。
癸日庚申时，作专印合禄。癸以戊为正官，庚为正印，申上庚旺戊生，以申合巳中戊丙，癸日得财官。若有倚托，柱中无财及破害刑冲官印，主贵。
1-158 靠贵人相助，守吉到老。

癸丑日庚申时,辰戌丑未年月,文章冠世,官至三品。子月坐禄,亦吉。`,
	"癸日辛酉": `六癸日生时辛酉，自身失地更何有；支中明暗被辛伤，无助利名终不就。
癸日辛酉时，明暗枭神。癸见辛为倒食，酉上辛建旺，癸失地。若无倚托救助者，遇贵生涯；有倚托则吉。
1-158 女命大忌，子女不和。

癸丑日辛酉时,秋月,印绶格,行官煞运,吉。冬,福禄双全。子寅年月,干头无戊己字,贵。`,
	"癸日壬戌": `六癸日生日壬戌，支内正官生财库；月兼有救贵多成，倚托若无终不富。
癸日壬戌时，水火既济，癸用丙丁为财，戊土为官，戊与癸合旺，为人智谋，通月气有倚托者贵；不通，平常；通火土月气，富贵双全；运气通，亦吉。
1-158 中年心灰意冷。

癸丑日壬戌时,刑,亥月,土厚地方上贵。辰申年月,南方运,状元。五月,南运,都宪。`,
	"癸日癸亥": `六癸日生时癸亥，禄马飞天临旺神；不见官星兼惹绊，必为贵格异常人。
癸日癸亥时，禄马飞天格，癸水亥健旺。癸用戊为官，丙为财，亥中丙戊俱绝，癸无财官，却亥去冲出巳中丙戊，飞来就癸为财官。柱无戊己惹绊及官星破禄，主贵。
1-158 最喜冬生。

癸丑日癸亥时,作拱禄格。巳酉丑生,福德秀气。午月平常。卯酉月,行南运,金紫风宪,但难为寿。`
};

window.BAZI_MONTHS = {
	"甲寅": `正月甲木，初春尚有余寒，得丙癸逢，富贵双全。癸藏丙透，名寒木向阳，主大富贵。倘风水不及，亦不失儒林俊秀。如无丙癸，平常人也。
-- 丙为重，癸有丑水都可。不能从；

正二月：
一派庚辛，主一生劳苦，克子刑妻，再支会金局，非贫即夭。如无丙丁，一派壬癸，又无戊己制之，名水泛木浮，死无棺椁。
如一派戊己，支会金局，为财多身弱，富屋贫人，终生劳苦，妻晚子迟。
或无庚金，有丁透，亦属文星，为木火通明之象，又名伤官生财格，主聪明雅秀。`,
	"甲卯": `二月甲木，庚金得所，名阳刃驾杀，可云小贵，异途显达，或主武职，但要财资之。柱中逢才，英雄独压万人。
若见癸水，困了才杀，主为光棍，重刃必定遭凶。性情凶暴。

正二月：
一派庚辛，主一生劳苦，克子刑妻，再支会金局，非贫即夭。如无丙丁，一派壬癸，又无戊己制之，名水泛木浮，死无棺椁。`,
	"甲辰": `三月甲木，木气相竭。先取庚金，次用壬水。庚壬两透，一榜堪图。但要运用相生，风水阴德，方许富贵。
或见一二庚金，独取壬水。壬透清秀之人，才学必富。
或天干透出二丙，庚藏支下，此钝斧无钢，富贵难求。若有壬癸破火，堪作秀才。`,
	"甲巳": `四月甲木退气，丙火司权，先癸后丁，又须有庚透。庚金太多，甲反受病。若得壬水，方配得中和，此人性好清高，假装富贵。
即荫袭显达，终日好作祸乱，善辨巧谈，喜作诗文。此理最验。如一庚二丙，稍有富贵。金多火多，又为下格。
或癸丁与庚齐透天干，此命可言科甲，即风水浅薄，亦有选拔之才。`,
	"甲午": `五六月甲木，木性虚焦。五月先癸后丁庚金次之。六月三伏生寒，丁火退气。先丁后庚，无癸亦可。或五月乏癸，用丁亦可，要运行北地为佳。
六月甲木，木盛先丁。五月癸庚两透为上格，六月丁庚两透亦为上格。用神既透，木火通明，自然富贵。
总之五六月用丁火，虽运行北地，不致于死。却不利运行火地，号曰木化成灰必死。`,
	"甲未": `五六月甲木，木性虚焦。五月先癸后丁庚金次之。六月三伏生寒，丁火退气。先丁后庚，无癸亦可。或五月乏癸，用丁亦可，要运行北地为佳。
六月甲木，木盛先丁。五月癸庚两透为上格，六月丁庚两透亦为上格。用神既透，木火通明，自然富贵。
若柱中多金，名曰杀重身轻，先富后贫，运不相扶，非贫即夭。`,
	"甲申": `三秋甲木，木性枯槁，金土乘旺，先丁后庚，丁庚两全，将甲造为画戟。

三月甲木，木气相竭。先取庚金，次用壬水。庚壬两透，一榜堪图。但要运用相生，风水阴德，方许富贵。
或见一二庚金，独取壬水。壬透清秀之人，才学必富。`,
	"甲酉": `八月甲木，木囚金旺。丁火为先，次用丙火，庚金再次。一丁一庚，科甲定显。癸水一透，科甲不全。
丙庚两透，富大贵小。丙丁全无，僧道之命。丙透无癸，富贵双全。有癸制丙，寻常之人。
支成火局，可许假贵，戊己一透，可作富翁。`,
	"壬寅": `正月壬水，汪洋之象，渊渊不息，既失其令，亦无泛滥之虞，盖水性秉弱故也。
先用庚金发水之源，次取丙火以除寒气，又次取戊土以止其流，不致汪洋无度。
得庚丙戊三者齐透天干，凤池桃浪之客。或庚成透，丙生在寅，亦主富贵恩荣。`,
	"壬卯": `二月寒气悉除，清流湛深，不可用火，专取戊土为堤岸，辛发其源。
戊辛两透，科甲有准。或戊辛两藏，无甲丁透干，定主秀才。
或无戊辛有庚，富贵庚透大富，庚藏小富。`
};
